Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
equence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:1e64a51985595e3cf0ba6afbc80a4c23db7a1906d9bc875470472dd432e2680c209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:1e64a51985595e3cf0ba6afbc80a4c23db7a1906d9bc875470472dd432e2680c" -> null
      - name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.sbeacon.data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "sbeacon/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "sbeacon/layers/binaries/"
      + type                = "zip"
    }

  # module.sbeacon.aws_kms_alias.pii_encryption_key will be destroyed
  # (because aws_kms_alias.pii_encryption_key is not in configuration)
  - resource "aws_kms_alias" "pii_encryption_key" {
      - arn            = "arn:aws:kms:ap-southeast-3:209479276142:alias/sbeacon-dataportal-pii" -> null
      - id             = "alias/sbeacon-dataportal-pii" -> null
      - name           = "alias/sbeacon-dataportal-pii" -> null
      - region         = "ap-southeast-3" -> null
      - target_key_arn = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - target_key_id  = "5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.aws_kms_key.pii_encryption_key will be destroyed
  # (because aws_kms_key.pii_encryption_key is not in configuration)
  - resource "aws_kms_key" "pii_encryption_key" {
      - arn                                = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "KMS key for PII encryption secrets" -> null
      - enable_key_rotation                = false -> null
      - id                                 = "5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - is_enabled                         = true -> null
      - key_id                             = "5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::209479276142:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                  - {
                      - Action    = [
                          - "kms:Decrypt",
                          - "kms:DescribeKey",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::209479276142:role/sbeacon-backend-dataPortal"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow Lambda access"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                             = "ap-southeast-3" -> null
      - rotation_period_in_days            = 0 -> null
      - tags                               = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all                           = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:40" -> (known after apply)
      ~ code_sha256                 = "uN/ZBSmEUMThLf/CAM4GT7FFmq1m/vShJy4kbdAVAR8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-12T12:00:20.516+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:40" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "qtkQ52jl5PtMcyWW/NLGLMFgZuLsVOgDPCSeaIfUvipMY9wu3U72K2uwhNnYHg9uewJha2l5a6ffnDDhlmgB9g==" -> (known after apply) # forces replacement
      ~ source_code_size            = 18107509 -> (known after apply)
      ~ version                     = "40" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal-20250725085318492000000003"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ on_create = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiTWVtdWxhaSBrb25maWd1cmFzaSBsaWZlY3ljbGUgb25fY3JlYXRlLi4uIgoKICAgICMgVHVuZ2d1IGhpbmdnYSBjb25kYSB0ZXJzZWRpYSAobWFrc2ltYWwgNSBtZW5pdCkKICAgIGVjaG8gIk1lbnVuZ2d1IGNvbmRhIG1lbmphZGkgdGVyc2VkaWEuLi4iCiAgICBmb3IgaSBpbiB7MS4uMzAwfTsgZG8KICAgICAgaWYgWyAtZiAiL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2giIF0gJiYgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoICYmIGNvbmRhIGluZm8gPi9kZXYvbnVsbCAyPiYxOyB0aGVuCiAgICAgICAgZWNobyAiQ29uZGEgdGVyc2VkaWEgc2V0ZWxhaCAkaSBkZXRpay4iCiAgICAgICAgYnJlYWsKICAgICAgZmkKICAgICAgc2xlZXAgMQogICAgZG9uZQoKICAgICMgQWt0aWZrYW4gZW52aXJvbm1lbnQgcHl0aG9uMyBqaWthIGNvbmRhIHNpYXAKICAgIGlmIGNvbW1hbmQgLXYgY29uZGEgPi9kZXYvbnVsbCAyPiYxOyB0aGVuCiAgICAgIGVjaG8gIk1lbmdha3RpZmthbiBlbnZpcm9ubWVudCBjb25kYS4uLiIKICAgICAgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoCiAgICAgIGNvbmRhIGFjdGl2YXRlIHB5dGhvbjMKCiAgICAgICMgQnVhdCBoYW5kbGVycy5weSB1bnR1ayBtZWxhcmFuZyBkb3dubG9hZAogICAgICBlY2hvICJNZW5lcmFwa2FuIGhhbmRsZXJzLnB5IHVudHVrIG1lbm9uYWt0aWZrYW4gZG93bmxvYWQuLi4iCiAgICAgIG1rZGlyIC1wIC9ob21lL2VjMi11c2VyLy5qdXB5dGVyCiAgICAgIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2hhbmRsZXJzLnB5CmZyb20gdG9ybmFkbyBpbXBvcnQgd2ViCmZyb20gbm90ZWJvb2suYmFzZS5oYW5kbGVycyBpbXBvcnQgSVB5dGhvbkhhbmRsZXIKCmNsYXNzIEZvcmJpZEZpbGVzSGFuZGxlcihJUHl0aG9uSGFuZGxlcik6CiAgQHdlYi5hdXRoZW50aWNhdGVkCiAgZGVmIGhlYWQoc2VsZiwgcGF0aCk6CiAgICBzZWxmLmxvZy5pbmZvKCJIRUFEOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBnZXQoc2VsZiwgcGF0aCwgaW5jbHVkZV9ib2R5PVRydWUpOgogICAgc2VsZi5sb2cuaW5mbygiR0VUOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCkVORAoKICAgICAgIyBCdWF0IGp1cHl0ZXJfbm90ZWJvb2tfY29uZmlnLnB5IHVudHVrIG1lbmdhdHVyIGhhbmRsZXIKICAgICAgZWNobyAiTWVuZXJhcGthbiBrb25maWd1cmFzaSBKdXB5dGVyLi4uIgogICAgICBjYXQgPDwgJ0VORCcgPiAvaG9tZS9lYzItdXNlci8uanVweXRlci9qdXB5dGVyX25vdGVib29rX2NvbmZpZy5weQppbXBvcnQgb3MsIHN5cwpzeXMucGF0aC5hcHBlbmQoJy9ob21lL2VjMi11c2VyLy5qdXB5dGVyLycpCmltcG9ydCBoYW5kbGVycwpjLkNvbnRlbnRzTWFuYWdlci5maWxlc19oYW5kbGVyX2NsYXNzID0gJ2hhbmRsZXJzLkZvcmJpZEZpbGVzSGFuZGxlcicKYy5Db250ZW50c01hbmFnZXIuZmlsZXNfaGFuZGxlcl9wYXJhbXMgPSB7fQpFTkQKCiAgICAgICMgUGFzdGlrYW4gaXppbiBmaWxlIGJlbmFyCiAgICAgIGVjaG8gIk1lbmdhdHVyIGl6aW4gZmlsZS4uLiIKICAgICAgY2hvd24gLVIgZWMyLXVzZXI6ZWMyLXVzZXIgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICAgICAgY2htb2QgLVIgNzU1IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyCgogICAgICAjIFJlc3RhcnQgSnVweXRlciBzZXJ2ZXIgdW50dWsgYXBwbHkgY2hhbmdlcwogICAgICBlY2hvICJNZW5jb2JhIHJlc3RhcnQgSnVweXRlciBzZXJ2ZXIuLi4iCiAgICAgIHN1ZG8gc3lzdGVtY3RsIHJlc3RhcnQganVweXRlci1zZXJ2ZXIgfHwgc3VkbyAvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvYmluL2p1cHl0ZXItbGFiICYKICAgICAgZWNobyAiS29uZmlndXJhc2kgc2VsZXNhaS4iCiAgICBlbHNlCiAgICAgIGVjaG8gIkNvbmRhIHRpZGFrIHRlcnNlZGlhIHNldGVsYWggNSBtZW5pdCwgbWVsZXdhdGthbiBrb25maWd1cmFzaS4iCiAgICBmaQoK" -> "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      ~ on_start  = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiTWVtdWxhaSBrb25maWd1cmFzaSBsaWZlY3ljbGUgb25fc3RhcnQuLi4iCgogICAgIyBUdW5nZ3UgaGluZ2dhIGNvbmRhIHRlcnNlZGlhIChtYWtzaW1hbCA1IG1lbml0KQogICAgZWNobyAiTWVudW5nZ3UgY29uZGEgbWVuamFkaSB0ZXJzZWRpYS4uLiIKICAgIGZvciBpIGluIHsxLi4zMDB9OyBkbwogICAgICBpZiBbIC1mICIvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaCIgXSAmJiBzb3VyY2UgL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2ggJiYgY29uZGEgaW5mbyA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgICAgICBlY2hvICJDb25kYSB0ZXJzZWRpYSBzZXRlbGFoICRpIGRldGlrLiIKICAgICAgICBicmVhawogICAgICBmaQogICAgICBzbGVlcCAxCiAgICBkb25lCgogICAgIyBBa3RpZmthbiBlbnZpcm9ubWVudCBweXRob24zIGppa2EgY29uZGEgc2lhcAogICAgaWYgY29tbWFuZCAtdiBjb25kYSA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgICAgZWNobyAiTWVuZ2FrdGlma2FuIGVudmlyb25tZW50IGNvbmRhLi4uIgogICAgICBzb3VyY2UgL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2gKICAgICAgY29uZGEgYWN0aXZhdGUgcHl0aG9uMwoKICAgICAgIyBCdWF0IGhhbmRsZXJzLnB5IHVudHVrIG1lbGFyYW5nIGRvd25sb2FkCiAgICAgIGVjaG8gIk1lbmVyYXBrYW4gaGFuZGxlcnMucHkgdW50dWsgbWVub25ha3RpZmthbiBkb3dubG9hZC4uLiIKICAgICAgbWtkaXIgLXAgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICAgICAgY2F0IDw8ICdFTkQnID4gL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvaGFuZGxlcnMucHkKZnJvbSB0b3JuYWRvIGltcG9ydCB3ZWIKZnJvbSBub3RlYm9vay5iYXNlLmhhbmRsZXJzIGltcG9ydCBJUHl0aG9uSGFuZGxlcgoKY2xhc3MgRm9yYmlkRmlsZXNIYW5kbGVyKElQeXRob25IYW5kbGVyKToKICBAd2ViLmF1dGhlbnRpY2F0ZWQKICBkZWYgaGVhZChzZWxmLCBwYXRoKToKICAgIHNlbGYubG9nLmluZm8oIkhFQUQ6IEZpbGUgZG93bmxvYWQgZm9yYmlkZGVuLiIpCiAgICByYWlzZSB3ZWIuSFRUUEVycm9yKDQwMykKCiAgQHdlYi5hdXRoZW50aWNhdGVkCiAgZGVmIGdldChzZWxmLCBwYXRoLCBpbmNsdWRlX2JvZHk9VHJ1ZSk6CiAgICBzZWxmLmxvZy5pbmZvKCJHRVQ6IEZpbGUgZG93bmxvYWQgZm9yYmlkZGVuLiIpCiAgICByYWlzZSB3ZWIuSFRUUEVycm9yKDQwMykKRU5ECgogICAgICAjIEJ1YXQganVweXRlcl9ub3RlYm9va19jb25maWcucHkgdW50dWsgbWVuZ2F0dXIgaGFuZGxlcgogICAgICBlY2hvICJNZW5lcmFwa2FuIGtvbmZpZ3VyYXNpIEp1cHl0ZXIuLi5tZW5nZ3VuYWthbiBoYW5kbGVyIgogICAgICBjYXQgPDwgJ0VORCcgPiAvaG9tZS9lYzItdXNlci8uanVweXRlci9qdXB5dGVyX25vdGVib29rX2NvbmZpZy5weQppbXBvcnQgb3MsIHN5cwpzeXMucGF0aC5hcHBlbmQoJy9ob21lL2VjMi11c2VyLy5qdXB5dGVyLycpCmltcG9ydCBoYW5kbGVycwpjLkNvbnRlbnRzTWFuYWdlci5maWxlc19oYW5kbGVyX2NsYXNzID0gJ2hhbmRsZXJzLkZvcmJpZEZpbGVzSGFuZGxlcicKYy5Db250ZW50c01hbmFnZXIuZmlsZXNfaGFuZGxlcl9wYXJhbXMgPSB7fQpFTkQKCiAgICAgICMgUGFzdGlrYW4gaXppbiBmaWxlIGJlbmFyCiAgICAgIGVjaG8gIk1lbmdhdHVyIGl6aW4gZmlsZS4uIi4KICAgICAgY2hvd24gLVIgZWMyLXVzZXI6ZWMyLXVzZXIgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICAgICAgY2htb2QgLVIgNzU1IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyCgogICAgICAjIFJlc3RhcnQgSnVweXRlciBzZXJ2ZXIgdW50dWsgYXBwbHkgY2hhbmdlcwogICAgICBlY2hvICJNZW5jb2JhIHJlc3RhcnQgSnVweXRlciBzZXJ2ZXIuLi4iCiAgICAgIHN1ZG8gc3lzdGVtY3RsIHJlc3RhcnQganVweXRlci1zZXJ2ZXIgfHwgc3VkbyAvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvYmluL2p1cHl0ZXItbGFiICYKICAgICAgZWNobyAiS29uZmlndXJhc2kgc2VsZXNhaS4iCiAgICBlbHNlCiAgICAgIGVjaG8gIkNvbmRhIHRpZGFrIHRlcnNlZGlhIHNldGVsYWggNSBtZW5pdCwgbWVsZXdhdGthbiBrb25maWd1cmFzaS4iCiAgICBmaQo=" -> "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
        tags      = {}
        # (3 unchanged attributes hidden)
    }

  # module.sbeacon.aws_secretsmanager_secret.dataportal_pii_encryption will be destroyed
  # (because aws_secretsmanager_secret.dataportal_pii_encryption is not in configuration)
  - resource "aws_secretsmanager_secret" "dataportal_pii_encryption" {
      - arn                            = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - description                    = "PII encryption keys for data portal sensitive data" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - kms_key_id                     = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626" -> null
      - name                           = "sbeacon-dataportal/pii-encryption-keys" -> null
      - recovery_window_in_days        = 30 -> null
      - region                         = "ap-southeast-3" -> null
      - tags                           = {
          - "Compliance"  = "HIPAA"
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
          - "Purpose"     = "PII-Encryption"
        } -> null
      - tags_all                       = {
          - "Compliance"  = "HIPAA"
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
          - "Purpose"     = "PII-Encryption"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_secretsmanager_secret_version.dataportal_pii_encryption will be destroyed
  # (because aws_secretsmanager_secret_version.dataportal_pii_encryption is not in configuration)
  - resource "aws_secretsmanager_secret_version" "dataportal_pii_encryption" {
      - arn            = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - id             = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk|terraform-20250902084851312400000002" -> null
      - region         = "ap-southeast-3" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20250902084851312400000002" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "8229067861598192965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "add3abce0e64b5451bb594398e3d605db0bb3d85" -> "bbc03975f95f05b59dedd9be2e829038e1191f06"
        }
    }

  # module.sbeacon.random_bytes.pii_primary_key will be destroyed
  # (because random_bytes.pii_primary_key is not in configuration)
  - resource "random_bytes" "pii_primary_key" {
      - base64 = (sensitive value) -> null
      - hex    = (sensitive value) -> null
      - length = 32 -> null
    }

  # module.sbeacon.random_bytes.pii_salt will be destroyed
  # (because random_bytes.pii_salt is not in configuration)
  - resource "random_bytes" "pii_salt" {
      - base64 = (sensitive value) -> null
      - hex    = (sensitive value) -> null
      - length = 16 -> null
    }

  # module.sbeacon.random_bytes.pii_secondary_key will be destroyed
  # (because random_bytes.pii_secondary_key is not in configuration)
  - resource "random_bytes" "pii_secondary_key" {
      - base64 = (sensitive value) -> null
      - hex    = (sensitive value) -> null
      - length = 32 -> null
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer:30" -> (known after apply)
      ~ code_sha256                 = "d8ln3UKYzYVCpbMsmCD9Rc6+wLaDJCrBZ1cWf84bPtI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-12T12:00:21.726+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer:30" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "H6COC0RYD//8OafVaaiRpI7YuE0ScevB/Z62LUcjqp5AQ2X+crq/V1+NPHntlT63KELAd56eqYNTycjXXo801Q==" -> "TEmpscdoFxzlWD35j8jCSyGignFX84EXfrjloOLlBthgxk7g3WjtePU0dt77uR3+BU7Sh2rXBjxGAqiuRO6KAg==" # forces replacement
      ~ source_code_size            = 17636006 -> (known after apply)
      ~ version                     = "30" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-14-gbb047bc0+" -> "v1.1.0-15-g6721dc5e+"
        id                            = "webgui-bucket-20250725085326820600000001/version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "8525fb87-3613-dc35-9dce-2fc2cde6b78f" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.1.0-14-gbb047bc0+" -> "v1.1.0-15-g6721dc5e+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3432386888495010175" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135805651000" -> "1757743119830272000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7025316376429329154" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135093343000" -> "1757743119070704000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3183952566277342059" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135543226000" -> "1757743120042677000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9141161486198060140" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635136042115000" -> "1757743120022514200"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4032955364016098300" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635136137042000" -> "1757743119052098000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "7164ee22d5deeba17e7481d716bfa63ad1e3b8dd"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:d0caf3a1828f0f475402d9ef90b316a597fa67972c934953b2b36a19d43033c8" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:d0caf3a1828f0f475402d9ef90b316a597fa67972c934953b2b36a19d43033c8" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "0f28f154dc6fded959e1b2fe18f1c88a56e0ade1" -> "7164ee22d5deeba17e7481d716bfa63ad1e3b8dd"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1d254f1da126bf493e7a1dcd597c2e81f10838b93271dc81771a6580d26a469d.zip" -> "builds/d5257725dad74e40d6fbac2dc33ee6ef1c029dfd0bef264047d9c487e9792aa0.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-12T12:01:47.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d5257725dad74e40d6fbac2dc33ee6ef1c029dfd0bef264047d9c487e9792aa0.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d5257725dad74e40d6fbac2dc33ee6ef1c029dfd0bef264047d9c487e9792aa0.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9181063245724608780" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1d254f1da126bf493e7a1dcd597c2e81f10838b93271dc81771a6580d26a469d.zip" -> "builds/d5257725dad74e40d6fbac2dc33ee6ef1c029dfd0bef264047d9c487e9792aa0.zip"
          ~ "timestamp" = "1757635135459580000" -> "1757743121148781000"
        }
    }

  # module.sbeacon.module.lambda-clinicalReports.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/sbeacon-backend-clinicalReports" -> null
      - id                = "/aws/lambda/sbeacon-backend-clinicalReports" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/sbeacon-backend-clinicalReports" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all          = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-clinicalReports.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/sbeacon-backend-clinicalReports" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-09-01T06:43:14Z" -> null
      - force_detach_policies = true -> null
      - id                    = "sbeacon-backend-clinicalReports" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "sbeacon-backend-clinicalReports" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXJHUCIHPOL" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "sbeacon-backend-clinicalReports-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:PutObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/projects/*/clinical-workflows/*/reports/*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "sbeacon-backend-clinicalReports-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/sbeacon-backend-clinicalReports:*:*",
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/sbeacon-backend-clinicalReports:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.sbeacon.module.lambda-clinicalReports.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "sbeacon-backend-clinicalReports:sbeacon-backend-clinicalReports-0" -> null
      - name        = "sbeacon-backend-clinicalReports-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/projects/*/clinical-workflows/*/reports/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sbeacon-backend-clinicalReports" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.module.lambda-clinicalReports.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "sbeacon-backend-clinicalReports:sbeacon-backend-clinicalReports-logs" -> null
      - name        = "sbeacon-backend-clinicalReports-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/sbeacon-backend-clinicalReports:*:*",
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/sbeacon-backend-clinicalReports:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sbeacon-backend-clinicalReports" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.module.lambda-clinicalReports.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-clinicalReports" -> null
      - code_sha256                    = "Wn/JSDlP/VDlb+X8CLgUDSqBPdu04vvdWdz0GE5d+08=" -> null
      - description                    = "Backend function to generate clinical reports." -> null
      - filename                       = "builds/11ea42024a37d810d56e8e264c22f462c479350dff401c56846a490b44f80bff.zip" -> null
      - function_name                  = "sbeacon-backend-clinicalReports" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "sbeacon-backend-clinicalReports" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-clinicalReports/invocations" -> null
      - last_modified                  = "2025-09-12T12:00:20.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-clinicalReports:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-clinicalReports:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/sbeacon-backend-clinicalReports" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Wn/JSDlP/VDlb+X8CLgUDSqBPdu04vvdWdz0GE5d+08=" -> null
      - source_code_size               = 8872580 -> null
      - tags                           = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "sbeacon-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "sbeacon-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 60 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DPORTAL_BUCKET"               = "gaspi-dataportal-20250725085318492000000003"
              - "DYNAMO_SVEP_REFERENCES_TABLE" = "svep-references"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/sbeacon-backend-clinicalReports" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.sbeacon.module.lambda-clinicalReports.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "6208873302210128938" -> null
      - triggers = {
          - "filename"  = "builds/11ea42024a37d810d56e8e264c22f462c479350dff401c56846a490b44f80bff.zip"
          - "timestamp" = "1757635135654849000"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk"
                    },
                  - {
                      - Action   = [
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626"
                    },
                  - {
                      - Action   = [
                          - "ec2:RunInstances",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeImages",
                          - "ec2:CreateTags",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                    {
                        Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:Scan",
                            "dynamodb:Query",
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                            "dynamodb:DescribeTable",
                            "dynamodb:DeleteItem",
                            "dynamodb:BatchWriteItem",
                            "dynamodb:BatchGetItem",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-users-quota",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-users-info",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-saved-queries",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-pricing-cache",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-juptyer-notebooks",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinical-variants",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinical-annotations",
                            "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                    # (10 unchanged elements hidden)
                    {
                        Action   = "s3:DeleteObject"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::svep-backend-temp-20250901021406544700000004/*",
                            "arn:aws:s3:::svep-backend-regions-20250901021405720800000003/*",
                        ]
                    },
                  ~ {
                      ~ Resource = [
                            # (3 unchanged elements hidden)
                            "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-generateCohortVCfs",
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-clinicalReports",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/69e7a1f2ac3eb4110027c1137c26fc077f2a605776619bea8ffadbf31f1f2d87.zip" -> "builds/dd3e9cd95a9054b5134ba178cbb2b001b551d10841bab14642356bac9b85f43c.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-12T12:05:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CLINICAL_REPORTS_LAMBDA"              = "sbeacon-backend-clinicalReports" -> null
              - "PII_ENCRYPTION_SECRET_NAME"           = "sbeacon-dataportal/pii-encryption-keys" -> null
              - "SECURITY_GROUP_ID"                    = "sg-05202b06b4cc76b23" -> null
              - "SUBNET_ID"                            = "subnet-03eb7dbc51b17dd6b" -> null
                # (53 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dd3e9cd95a9054b5134ba178cbb2b001b551d10841bab14642356bac9b85f43c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dd3e9cd95a9054b5134ba178cbb2b001b551d10841bab14642356bac9b85f43c.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3921585113440617730" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/69e7a1f2ac3eb4110027c1137c26fc077f2a605776619bea8ffadbf31f1f2d87.zip" -> "builds/dd3e9cd95a9054b5134ba178cbb2b001b551d10841bab14642356bac9b85f43c.zip"
          ~ "timestamp" = "1757678241659559000" -> "1757743120830113000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2284991304018767640" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135115676000" -> "1757743121231268000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5865511258675340519" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135590283000" -> "1757743123796083000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateReports:sbeacon-backend-generateReports-0"
        name        = "sbeacon-backend-generateReports-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ap-southeast-3:209479276142:secret:sbeacon-dataportal/pii-encryption-keys-cSVYkk"
                    },
                  - {
                      - Action   = [
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-southeast-3:209479276142:key/5ed9009c-2b2e-45d6-a7ae-f7585461e626"
                    },
                    {
                        Action   = "s3:PutObject"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/projects/*/clinical-workflows/*/reports/*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/84c34e2c2d1bceaf525ad699bea39d72e33bc30e8b2f5bee860c46a4dad39020.zip" -> "builds/a3bd3a0f1c47f2b9203579deb40dc83a13faff89911f7296c5b32fa203cc2e2e.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-12T12:01:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ]
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "PII_ENCRYPTION_SECRET_NAME"   = "sbeacon-dataportal/pii-encryption-keys" -> null
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a3bd3a0f1c47f2b9203579deb40dc83a13faff89911f7296c5b32fa203cc2e2e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a3bd3a0f1c47f2b9203579deb40dc83a13faff89911f7296c5b32fa203cc2e2e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2997922664180430229" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/84c34e2c2d1bceaf525ad699bea39d72e33bc30e8b2f5bee860c46a4dad39020.zip" -> "builds/a3bd3a0f1c47f2b9203579deb40dc83a13faff89911f7296c5b32fa203cc2e2e.zip"
          ~ "timestamp" = "1757635135044339800" -> "1757743120555799000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2533092382353546453" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635136064318000" -> "1757743120285269000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2086035095657764940" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135197774000" -> "1757743120573186000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5803927649968869256" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135531074000" -> "1757743119984729000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/5e039bdce7d130c97b9f2c3f4800a977b6ad3b1eb045cf67db11ae075cff0ef1.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-12T12:02:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5e039bdce7d130c97b9f2c3f4800a977b6ad3b1eb045cf67db11ae075cff0ef1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5e039bdce7d130c97b9f2c3f4800a977b6ad3b1eb045cf67db11ae075cff0ef1.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6219691503081433565" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/5e039bdce7d130c97b9f2c3f4800a977b6ad3b1eb045cf67db11ae075cff0ef1.zip"
          ~ "timestamp" = "1757635136120903000" -> "1757743121924162000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1451627934581436976" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135750150000" -> "1757743120878367000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6268507730681439833" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135581063000" -> "1757743119978566800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2421440277950723164" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635136001529000" -> "1757743120380321000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:48",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:69",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1967905336910863937" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1757635135460841800" -> "1757743120230412000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.